## Extract Tranform  Load

ETL, which stands for Extract, Transform, Load, is a crucial process in data management. It involves retrieving data from various sources, modifying it to fit business needs or target system requirements, and then loading it into a central location

In [1]:
import pandas as pd
df =pd.read_csv('PRAC_DATA.csv')

#pull up the info on the table
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21 entries, 0 to 20
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Fname       21 non-null     object
 1   Lname       21 non-null     object
 2   Gender      21 non-null     object
 3   Grade       21 non-null     object
 4   HoursStudy  21 non-null     int64
dtypes: int64(1), object(4)
memory usage: 968.0+ bytes

In [3]:
#pull up the first five observations
df.head()

     Fname     Lname Gender Grade  HoursStudy
0     Mary  Ettienne      F     B          16
1  Charles    Looner      M     F           8
2    Betty  Franklin      F     A          24
3    Roger   Withers      M     C           5
4     John   Mulgrew      M     A           5

In [2]:
import pandas as pd
df =pd.read_excel('PRAC_DATA2.xlsx')

In [3]:
# for a specific worksheet in the excel file
import pandas as pd
xl = pd.ExcelFile('PRAC_DATA2.xlsx')
xl.sheet_names
df = xl.parse("Sheet1")
df.head()

     Fname     Lname Gender Grade  Hours of Study
0     Mary  Ettienne      F     B              16
1  Charles    Looner      M     F               8
2    Betty  Franklin      F     A              24
3    Roger   Withers      M     C               5
4     John   Mulgrew      M     A               5

In [4]:
from zipfile import ZipFile    # Import zipfile


file = 'Testzip2.zip'          # Full path to the zip file, or simply the file name 
                               # if the file is in your current working directory
zip_file = ZipFile(file, 'r')  # Read zipfile and extract contents
zip_file.printdir()            # List files in the zip files
zip_file.extractall()          # Extract files in the zip file

File Name                                             Modified             Size
PRAC_DATA7.xlsx                                2024-03-24 21:20:42        10555

In [5]:
import pandas as pd
xl = pd.ExcelFile('PRAC_DATA7.xlsx')
xl.sheet_names
df = xl.parse("Sheet1")
df.head()

     Fname     Lname Gender Grade  Hours of Study
0     Mary  Ettienne      F     B              16
1  Charles    Looner      M     F               8
2    Betty  Franklin      F     A              24
3    Roger   Withers      M     C               5
4     John   Mulgrew      M     A               5

In [6]:
text_file = open('iris_data.txt','r') 
text_file

In [ ]:
text_file.read()    # Read complete information from the file

In [10]:
df =pd.read_csv('iris_data.txt', sep=",", header=None, names=['Sepal.Length','Sepal.Width' ,'Petal.Length' ,'Petal.Width','Species'])

In [11]:
df

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width         Species
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [8]:
import json


file = open('Test2.json')    # Full path to the json file, or simply the file name 
                               # if the firle is in your current working directory
json_file = json.load(file)    # Returns JSON object as a dictionary

In [18]:
json_file

{'firstName': 'Jane',
 'lastName': 'Doe',
 'hobbies': 'running',
 'age': 35,
 'children': 'yes'}

In [27]:
df2 = pd.DataFrame.from_dict(json_file , orient="index")

In [28]:
df2

                 0
firstName     Jane
lastName       Doe
hobbies    running
age             35
children       yes

In [29]:
pd.DataFrame(json_file.items(), columns=['Information', 'Values'])

  Information   Values
0   firstName     Jane
1    lastName      Doe
2     hobbies  running
3         age       35
4    children      yes

## Databases

In [30]:
import pyodbc

In [31]:
import sqlalchemy as sa

In [32]:
from sqlalchemy import create_engine

In [33]:
Server = 'DESKTOP-22G7PV9'
Database = 'Test'
Driver = 'SQL Server'
Database_Con = f'mssql://@{Server}/{Database}?driver={Driver}'

In [34]:
engine=create_engine(Database_Con)
con=engine.connect()

In [35]:
df=pd.read_sql_query("Select * from[dbo].[Table_1]",con)
df

       F_Name      L_Name  Wages
0  Bob         Yule        154.0
1  Mike        Chair       120.0
2  Stric       Tiu         500.0
3  Ti          Chair       150.0
4  Uyt         Anatoly     451.0

In [36]:
#incert data into MS SQL Sever
df =pd.read_csv('iris_data.txt', sep=",", header=None, names=['Sepal.Length','Sepal.Width' ,'Petal.Length' ,'Petal.Width','Species'])


#Using sqlalchemy to enter data in MS Sql server (much easier)

df.to_sql('Table_NameRw', con=engine, if_exists='append', index=False)

-1

In [37]:
con.close() #close

In [ ]:
import pyodbc

In [38]:
SERVER_NAME = 'DESKTOP-22G7PV9'
DATABASE_NAME = 'Test'
USERNAME = 'DESKTOP-22G7PV9\DELL'

In [39]:
conn= pyodbc.connect('Driver={SQL Server};' 'Server=DESKTOP-22G7PV9;' 'Database=Test;' 'Trusted_connection=yes')

In [40]:
cursor=conn.cursor()

In [41]:
query = "SELECT * FROM Table_1"
cursor.execute(query)

In [43]:
#enter new data
cursor.execute('''
                INSERT INTO Table_1 (F_Name, L_Name, Wages)
                VALUES
                ('Tia','Chairy',154)
                ''')
conn.commit()

In [44]:
#Lets verify here using Pandas
import pandas as pd
df=pd.read_sql_query("Select * from[dbo].[Table_1]",conn)
df

C:\Users\DELL\AppData\Local\Temp\ipykernel_57624\610202627.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df=pd.read_sql_query("Select * from[dbo].[Table_1]",conn)

       F_Name      L_Name  Wages
0  Bob         Yule        154.0
1  Mike        Chair       120.0
2  Stric       Tiu         500.0
3  Ti          Chair       150.0
4  Tia         Chairy      154.0
5  Uyt         Anatoly     451.0

In [45]:
conn.close() #close

## Data wrangling

Data wrangling is the process of transforming raw data into a more structured format.  
organizing data by numerical data rather than categorical values or organizing
data in tables rather than columns

We will  use Pandas

In [46]:
dummy_data1 = {
        'id': ['1', '2', '3', '4', '5'],
        'Feature1': ['A', 'C', 'E', 'G', 'I'],
        'Feature2': ['B', 'D', 'F', 'H', 'J']}

df1 = pd.DataFrame(dummy_data1, columns = ['id', 'Feature1', 'Feature2'])

df1

  id Feature1 Feature2
0  1        A        B
1  2        C        D
2  3        E        F
3  4        G        H
4  5        I        J

In [47]:
dummy_data2 = {
        'id': ['1', '2', '6', '7', '8'],
        'Feature3': ['K', 'M', 'O', 'Q', 'S'],
        'Feature4': ['L', 'N', 'P', 'R', 'T']}

df2 = pd.DataFrame(dummy_data2, columns = ['id', 'Feature3', 'Feature4'])

df2

  id Feature3 Feature4
0  1        K        L
1  2        M        N
2  6        O        P
3  7        Q        R
4  8        S        T

# Concat

Concatenate pandas objects along a particular axis.

In [48]:
row_concat = pd.concat([df1, df2])
row_concat

  id Feature1 Feature2 Feature3 Feature4
0  1        A        B      NaN      NaN
1  2        C        D      NaN      NaN
2  3        E        F      NaN      NaN
3  4        G        H      NaN      NaN
4  5        I        J      NaN      NaN
0  1      NaN      NaN        K        L
1  2      NaN      NaN        M        N
2  6      NaN      NaN        O        P
3  7      NaN      NaN        Q        R
4  8      NaN      NaN        S        T

In [49]:
#Filter at the 0 index

row_concat.loc[0]

  id Feature1 Feature2 Feature3 Feature4
0  1        A        B      NaN      NaN
0  1      NaN      NaN        K        L

In [52]:
#for positional indexing - below is an example of getting the first observation

row_concat.iloc[0]

id            1
Feature1      A
Feature2      B
Feature3    NaN
Feature4    NaN
Name: 0, dtype: object

In [53]:
#reset the index for use

row_concat_reset = pd.concat([df1, df2], ignore_index=True)
row_concat_reset

  id Feature1 Feature2 Feature3 Feature4
0  1        A        B      NaN      NaN
1  2        C        D      NaN      NaN
2  3        E        F      NaN      NaN
3  4        G        H      NaN      NaN
4  5        I        J      NaN      NaN
5  1      NaN      NaN        K        L
6  2      NaN      NaN        M        N
7  6      NaN      NaN        O        P
8  7      NaN      NaN        Q        R
9  8      NaN      NaN        S        T

In [54]:
row_concat_reset['id']

0    1
1    2
2    3
3    4
4    5
5    1
6    2
7    6
8    7
9    8
Name: id, dtype: object

# Merging

Similar to a database’s join operations. It’s the most flexible operations of combining tables.
Use its when you want to combine data objects based on one or more keys, most useful 
when you want to combine rows that share data.

You can achieve both many-to-one and many-to-many joins with merge().
*this can cause duplicates in your data

Types of merge:

-inner
-outer
-left
-right

In [55]:
#inner join

inner= pd.merge(df1,df2, on=["id"])
inner
inner.shape

(2, 5)

In [56]:
#Outer Join

outer= pd.merge(df1,df2, how="outer", on=["id"])
outer
outer.shape

(8, 5)

In [57]:
#Left Join
left = pd.merge(df1,df2,  how="left", on=["id"])
left

  id Feature1 Feature2 Feature3 Feature4
0  1        A        B        K        L
1  2        C        D        M        N
2  3        E        F      NaN      NaN
3  4        G        H      NaN      NaN
4  5        I        J      NaN      NaN

In [58]:
#right Join
right= pd.merge(df1,df2,  how="right", on=["id"])
right

  id Feature1 Feature2 Feature3 Feature4
0  1        A        B        K        L
1  2        C        D        M        N
2  6      NaN      NaN        O        P
3  7      NaN      NaN        Q        R
4  8      NaN      NaN        S        T

# Converting data types in dataframes

In [61]:
# converting all columns to string type
df1 = df1.astype(str)
df1.dtypes

id          object
Feature1    object
Feature2    object
dtype: object

In [62]:
# sample dataframe
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': ['a', 'b', 'c', 'd', 'e'],
    'C': [1.1, '1.0', '1.3', 2, 5]})
 
# using dictionary to convert specific columns
convert_dict = {'A': int,
                'C': float
                }
 
df = df.astype(convert_dict)
print(df.dtypes)

A      int32
B     object
C    float64
dtype: object

In [63]:
df1.dtypes
# using apply method
df1[['id']] = df1[['id']].apply(pd.to_numeric)
df1.dtypes

id           int64
Feature1    object
Feature2    object
dtype: object

# Create a new column

In [64]:
#using lambda

df1=df1.assign(id2 = lambda x: (x['id']+1))
df1

   id Feature1 Feature2  id2
0   1        A        B    2
1   2        C        D    3
2   3        E        F    4
3   4        G        H    5
4   5        I        J    6

In [65]:
df1 = df1.assign(nid=lambda row: row.id * 1.5)
df1

   id Feature1 Feature2  id2  nid
0   1        A        B    2  1.5
1   2        C        D    3  3.0
2   3        E        F    4  4.5
3   4        G        H    5  6.0
4   5        I        J    6  7.5

In [66]:
df1['brand_new']= df1['id2']+df1['nid']
df1

   id Feature1 Feature2  id2  nid  brand_new
0   1        A        B    2  1.5        3.5
1   2        C        D    3  3.0        6.0
2   3        E        F    4  4.5        8.5
3   4        G        H    5  6.0       11.0
4   5        I        J    6  7.5       13.5

# Subset or drop columns

In [67]:
#drop column

del df1['brand_new']

In [68]:
df1

   id Feature1 Feature2  id2  nid
0   1        A        B    2  1.5
1   2        C        D    3  3.0
2   3        E        F    4  4.5
3   4        G        H    5  6.0
4   5        I        J    6  7.5

In [69]:
df1 = df1.drop(columns=['id2', 'nid'])

In [70]:
#subset
#subset based on a condition

# subset of dataframe
above_2 = df1[df1["id"] > 2]
above_2

   id Feature1 Feature2
2   3        E        F
3   4        G        H
4   5        I        J

In [71]:
#using the index

# Select rows 0, 1, 2 (row 3 is not selected)
df1[0:3]

   id Feature1 Feature2
0   1        A        B
1   2        C        D
2   3        E        F

In [ ]:
# Select the first 5 rows (rows 0, 1, 2, 3, 4)
df1[:5]

In [ ]:
# Syntax for iloc indexing to finding a specific data element
#dat.iloc[row, column]

df1.iloc[2, 2]

In [ ]:
df1[df1.id == 2]

# Transposing

In [ ]:
#using the melt function in Pandas  -  changes data table from wide to long or long to wide

#syntax
#DataFrame.melt(id_vars=None, value_vars=None, var_name=None, 
#               value_name='value', col_level=None, ignore_index=True)

In [72]:
d1 = {"Name": ["Pankaj", "Lisa", "David"], "ID": [1, 2, 3], "Role": ["CEO", "Editor", "Author"]}

df = pd.DataFrame(d1)

print(df)

     Name  ID    Role
0  Pankaj   1     CEO
1    Lisa   2  Editor
2   David   3  Author

In [73]:
df_melted = pd.melt(df, id_vars=["ID"], value_vars=["Name", "Role"])

print(df_melted)

   ID variable   value
0   1     Name  Pankaj
1   2     Name    Lisa
2   3     Name   David
3   1     Role     CEO
4   2     Role  Editor
5   3     Role  Author

In [74]:
#multiple columns as id

df_melted = pd.melt(df, id_vars=["ID", "Name"], value_vars=["Role"])
print(df_melted)

   ID    Name variable   value
0   1  Pankaj     Role     CEO
1   2    Lisa     Role  Editor
2   3   David     Role  Author

In [75]:
df_melted = pd.melt(df, id_vars=["Name"], value_vars=["Role"])
print(df_melted)

     Name variable   value
0  Pankaj     Role     CEO
1    Lisa     Role  Editor
2   David     Role  Author

In [76]:
# unmelt - get to the orginal dataframe
d1 = {"Name": ["Pankaj", "Lisa", "David"], "ID": [1, 2, 3], "Role": ["CEO", "Editor", "Author"]}

df = pd.DataFrame(d1)

# print(df)

df_melted = pd.melt(df, id_vars=["ID"], value_vars=["Name", "Role"], var_name="Attribute", value_name="Value")

print(df_melted)

# unmelting using pivot()

df_unmelted = df_melted.pivot(index='ID', columns='Attribute')

print(df_unmelted)

   ID Attribute   Value
0   1      Name  Pankaj
1   2      Name    Lisa
2   3      Name   David
3   1      Role     CEO
4   2      Role  Editor
5   3      Role  Author
            Value
Attribute    Name    Role
ID
1          Pankaj     CEO
2            Lisa  Editor
3           David  Author

In [77]:
# in unmelete we need to reset the index

df_unmelted = df_unmelted['Value'].reset_index()
df_unmelted.columns.name = None
print(df_unmelted)

   ID    Name    Role
0   1  Pankaj     CEO
1   2    Lisa  Editor
2   3   David  Author

# Exporting data

After we complete our work we may want to export our results in an external file.

In [79]:
df2 = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': ['a', 'b', 'c', 'd', 'e'],
    'C': [1.1, '1.0', '1.3', 2, 5]})

df2.to_csv('F:\YOUR DIRECTORY\data.csv' , sep=',')

In [ ]:
# writing to Excel
datatoexcel = pd.ExcelWriter('F:\YOUR DIRECTORY\CarsData1.xlsx')
 
# write DataFrame to excel
df2.to_excel(datatoexcel)
 
# save the excel
datatoexcel.save()